Revit 2024 API
Railing.IsDefault Property
 Indicates if the railing is the default one that system generates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsDefault { get; }
Visual Basic
Public ReadOnly Property IsDefault As Boolean
	Get
Visual C++
public:
property bool IsDefault {
	bool get ();
}
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace